app/controllers/books_controller.rb

INSERT INTO `books` (`name`, `mrp`, `created_at`, `isbn`, `updated_at`, `sale_price`) VALUES('let us c', NULL, '2011-02-19 17:23:35', NULL, '2011-02-19 17:23:35', NULL)
INSERT INTO `authors` (`name`, `created_at`, `updated_at`) VALUES('kanitkar', '2011-02-19 17:27:40', '2011-02-19 17:27:40')
---
  def add
    book_tags = []
    if request.post?
      book_fields = params[:book]
      book_tags << book_fields[:tag_list]
      book_tags << book_fields[:name]
      book_tags << book_fields[:author]

SELECT * FROM `tags` WHERE (name LIKE '%comp%')
---
  def tags
    tags = ActsAsTaggableOn::Tag.where("name LIKE '%#{params[:q]}%'")